In [ ]:
!apt-get install sqlite3

In [2]:
import sqlite3

In [3]:
import os

In [ ]:
if os.path.exists('PortfolioProject.db'): #Substitute with your DB name
    os.remove('PortfolioProject.db')
    print('Database deleted.')
else:
    print('Database does not exist.')

In [5]:
conn = sqlite3.connect('PortfolioProject.db') #Substitute with your DB name

IN THE ABOVE STEP WE MADE A CONNECTION TO THE DATABASE AND ACTIVATED IT FOR DATA QUERIES.

In [6]:
import pandas as pd
#import sqlite3

# Connect to the database
conn = sqlite3.connect('PortfolioProject.db')

# Read the data from the Excel file into a pandas DataFrame
df = pd.read_excel('NashvilleHousing.xlsx')

# Insert the data from the DataFrame into the database table
df.to_sql('NashvilleHousing', conn, if_exists='append', index=False)

56477

In [7]:
conn.commit()

THING TO EXECUTE YOUR SQL QUERY USING SQLITE AND COLAB

In [ ]:
##execute the SQL query and fetch the results
# cursor = conn.execute("")
# results = cursor.fetchall()

# # create a pandas dataframe from the results
# df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])

# # display the dataframe as a table
# display(df)

In [ ]:
# from google.colab import data_table
# data_table.enable_dataframe_formatter()

In [ ]:
# # Read the Excel file into a dataframe
# df = pd.read_excel("NashvilleHousing.xlsx")

# # Display the dataframe using DataTables
# data_table.DataTable(df)

In [ ]:
# execute the SQL query and fetch the results
cursor = conn.execute("SELECT * FROM PRAGMA_TABLE_INFO('NashvilleHousing')")
results = cursor.fetchall()

# create a pandas dataframe from the results
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])

# display the dataframe as a table
display(df)

In [ ]:
# execute the SQL query and fetch the results
cursor = conn.execute("SELECT * FROM NashvilleHousing LIMIT 3")
results = cursor.fetchall()

# create a pandas dataframe from the results
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])

# display the dataframe as a table
display(df)

In [ ]:
# # convert SaleDate to datetime format
# df['SaleDate'] = pd.to_datetime(df['SaleDate'])

# # convert SaleDate to date format
# df['SaleDate'] = df['SaleDate'].dt.date

# # display the dataframe
# display(df)

In [ ]:
# execute the SQL query and fetch the results
cursor = conn.execute("SELECT SaleDate, CAST(SaleDate AS DATE) AS SaleDateOnly FROM NashvilleHousing LIMIT 3")
results = cursor.fetchall()

# for result in results:
#   print(result)
# create a pandas dataframe from the results
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])

# display the dataframe as a table
display(df)

In [13]:
#Standardizing Date Format
cursor = conn.execute("UPDATE NashvilleHousing SET SaleDate = CAST(SaleDate AS DATE) ")

In [ ]:
#Try This Code if the above cell not fine with your table
cursor = conn.execute("ALTER TABLE NashvilleHousing Add SaleDateConverted Date;")
cursor = conn.execute("Update NashvilleHousing SET SaleDateConverted = CAST(SaleDate AS DATE)")
cursor = conn.execute("Select saleDateConverted, CAST(SaleDate AS DATE) From NashvilleHousing")

results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [ ]:
#Populating Property Address Data CHECK NULL and NOT NULL
cursor = conn.execute("SELECT PropertyAddress FROM NashvilleHousing WHERE PropertyAddress IS NOT NULL LIMIT 5")


results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [ ]:
#In this we are joining the tavle by self Join which can be helped to create Column of MergedPropertyAdderess if the Propertyaddress is null
cursor = conn.execute("SELECT a.ParcelID, a.PropertyAddress, b.ParcelID, b.PropertyAddress, COALESCE(a.PropertyAddress, b.PropertyAddress) AS MergedPropertyAddress FROM NashvilleHousing a JOIN NashvilleHousing b ON a.ParcelID = b.ParcelID AND a.[UniqueID ] <> b.[UniqueID ] WHERE a.PropertyAddress IS NULL")
results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [32]:
cursor = conn.execute("UPDATE NashvilleHousing SET PropertyAddress = COALESCE(PropertyAddress, (SELECT b.PropertyAddress FROM NashvilleHousing b WHERE NashvilleHousing.ParcelID = b.ParcelID AND NashvilleHousing.[UniqueID ] <> b.[UniqueID ] AND b.PropertyAddress IS NOT NULL LIMIT 1)) WHERE PropertyAddress IS NULL")

In [ ]:
cursor = conn.execute("SELECT a.ParcelID, a.PropertyAddress, b.ParcelID, b.PropertyAddress, COALESCE(a.PropertyAddress, b.PropertyAddress) AS MergedPropertyAddress FROM NashvilleHousing a JOIN NashvilleHousing b ON a.ParcelID = b.ParcelID AND a.[UniqueID ] <> b.[UniqueID ] WHERE a.PropertyAddress IS  NULL LIMIT 5")
results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

Breaking out Address into Individual Columns (Address, City, State

In [ ]:
cursor = conn.execute("Select PropertyAddress From NashvilleHousing LIMIT 5")
#--Where PropertyAddress is null --order by ParcelID 

results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [ ]:
cursor = conn.execute("SELECT substr(PropertyAddress, 1, instr(PropertyAddress,',')) AS Address FROM NashvilleHousing")
results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [ ]:
cursor = conn.execute("SELECT substr(PropertyAddress, 1, instr(PropertyAddress,',')-1) AS Address, substr(PropertyAddress, instr(PropertyAddress,',') +1, LENGTH(PropertyAddress)) AS Address FROM NashvilleHousing")
results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [64]:
cursor = conn.execute("ALTER TABLE NashvilleHousing ADD PropertySplitAddress nvarchar(255)")
cursor = conn.execute("Update NashvilleHousing SET PropertySplitAddress = substr(PropertyAddress, 1, instr(PropertyAddress,',')-1)")

In [ ]:
cursor = conn.execute("ALTER TABLE NashvilleHousing ADD  PropertySplitCity nvarchar(255)")
cursor = conn.execute("Update NashvilleHousing SET PropertySplitCity = substr(PropertyAddress, instr(PropertyAddress,',') +1, LENGTH(PropertyAddress))")

In [ ]:
cursor = conn.execute("SELECT * FROM NashvilleHousing")

results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [ ]:
#Want to format out the OwnerAddress
cursor = conn.execute("SELECT OwnerAddress FROM NashvilleHousing")

results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [ ]:
cursor = conn.execute("SELECT OwnerAddress, substr(OwnerAddress, 1, instr(OwnerAddress, ',')-1) as Address1, substr(OwnerAddress, instr(OwnerAddress, ',')+1, instr(substr(OwnerAddress, instr(OwnerAddress, ',')+1), ',')-1) as Address2, substr(OwnerAddress, instr(substr(OwnerAddress, instr(OwnerAddress, ',')+1), ',')+1) as Address3 FROM NashvilleHousing")

results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

Supporting up the Table to have 3 new coulmns

In [93]:
cursor = conn.execute("ALTER TABLE NashvilleHousing ADD  OwnerSplitAddress nvarchar(255)")
cursor = conn.execute("Update NashvilleHousing SET OwnerSplitAddress = substr(OwnerAddress, 1, instr(OwnerAddress, ',')-1)")

In [100]:
#cursor = conn.execute("ALTER TABLE NashvilleHousing ADD  OwnerSplitCity nvarchar(255)")
cursor = conn.execute("Update NashvilleHousing SET OwnerSplitCity = substr(OwnerAddress, instr(OwnerAddress, ',')+1, instr(substr(OwnerAddress, instr(OwnerAddress, ',')+1), ',')-1)")

In [110]:
#cursor = conn.execute("ALTER TABLE NashvilleHousing ADD  OwnerSplitState nvarchar(255)")
cursor = conn.execute("UPDATE NashvilleHousing SET OwnerSplitState = SUBSTR(OwnerAddress, INSTR(OwnerAddress, ',')+2)")

In [112]:
cursor = conn.execute("UPDATE NashvilleHousing SET OwnerSplitState = SUBSTR(OwnerAddress, -2, 2)")

In [ ]:
cursor = conn.execute("SELECT * FROM NashvilleHousing")

results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [ ]:
#Changing the value of Y to Yes and N to NO

cursor = conn.execute("SELECT DISTINCT(SoldAsVacant), COUNT(SoldAsVacant) FROM NashvilleHousing GROUP BY SoldAsVacant")

results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [ ]:
cursor = conn.execute("SELECT SoldAsVacant, CASE WHEN SoldAsVacant = 'Y' THEN 'YES' WHEN SoldAsVacant = 'N' THEN 'NO' ELSE SoldAsVAcant END FROM NashvilleHousing")

results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

In [142]:
cursor = conn.execute("UPDATE NashvilleHousing SET SoldAsVacant = CASE WHEN SoldAsVacant = 'YES' THEN 'Yes' WHEN SoldAsVacant = 'NO' THEN 'No' ELSE SoldAsVacant END")
conn.commit()

In [ ]:
cursor = conn.execute("SELECT DISTINCT(SoldAsVacant), COUNT(SoldAsVacant) FROM NashvilleHousing GROUP BY SoldAsVacant")

results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

REOMOVING DUPLICATES
ROW_NUMBER

In [153]:
cursor = conn.execute("WITH RowNumCTE AS ( SELECT *, ROW_NUMBER() OVER ( PARTITION BY ParcelID, PropertyAddress, SalePrice, SaleDate, LegalReference ORDER BY [UniqueID ] ) row_num FROM NashvilleHousing ) SELECT * FROM RowNumCTE WHERE row_num > 1 ORDER BY PropertyAddress")
results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

,UniqueID,ParcelID,LandUse,PropertyAddress,SaleDate,SalePrice,LegalReference,SoldAsVacant,OwnerName,OwnerAddress,...,Bedrooms,FullBath,HalfBath,SaleDateConverted,PropertySplitCity,PropertySplitAddress,OwnerSplitAddress,OwnerSplitCity,OwnerSplitState,row_num
0,27354,107 14 0 157.00,SINGLE FAMILY,"1003 BRILEY PKWY, NASHVILLE",2015,80000,20150219-0014347,No,"GREEN, KASSANDRA","1003 BRILEY PKWY, NASHVILLE, TN",...,2.0,2.0,0.0,2015,NASHVILLE,1003 BRILEY PKWY,1003 BRILEY PKWY,NASHVILLE,TN,2
1,27383,150 04 0 144.00,SINGLE FAMILY,"1005 ESTURBRIDGE CT, ANTIOCH",2015,180000,20150213-0013547,No,"TINNEY, STU","1005 ESTURBRIDGE CT, ANTIOCH, TN",...,4.0,3.0,0.0,2015,ANTIOCH,1005 ESTURBRIDGE CT,1005 ESTURBRIDGE CT,ANTIOCH,TN,2
2,27362,119 16 0 084.00,DUPLEX,"1006 DRUMMOND DR, NASHVILLE",2015,80000,20150218-0014086,No,"POST, KEVIN","1006 DRUMMOND DR, NASHVILLE, TN",...,4.0,3.0,0.0,2015,NASHVILLE,1006 DRUMMOND DR,1006 DRUMMOND DR,NASHVILLE,TN,2
3,27132,091 08 0 056.00,SINGLE FAMILY,"1011 43RD AVE N, NASHVILLE",2015,69900,20150227-0017102,No,"MENDING HEARTS, INC.","1011 43RD AVE N, NASHVILLE, TN",...,3.0,2.0,0.0,2015,NASHVILLE,1011 43RD AVE N,1011 43RD AVE N,NASHVILLE,TN,2
4,27368,135 10 0E 020.00,RESIDENTIAL CONDO,"1023 CAPITAL FUNDS CT, NASHVILLE",2015,118981,20150210-0012380,No,None,None,...,NaN,NaN,NaN,2015,NASHVILLE,1023 CAPITAL FUNDS CT,None,None,None,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
115,27378,149 04 0A 010.00,SINGLE FAMILY,"908 TOWNVIEW PL, NASHVILLE",2015,138900,20150210-0012194,No,None,None,...,NaN,NaN,NaN,2015,NASHVILLE,908 TOWNVIEW PL,None,None,None,2
116,36772,094 05 0 039.00,SINGLE FAMILY,"910 S 13TH ST, NASHVILLE",2015,137000,20150427-0037202,No,"PAIGE, RYAN","910 S 13TH ST, NASHVILLE, TN",...,2.0,1.0,0.0,2015,NASHVILLE,910 S 13TH ST,910 S 13TH ST,NASHVILLE,TN,2
117,38286,082 08 0 111.00,SINGLE FAMILY,"923 W EASTLAND AVE, NASHVILLE",2015,320000,20150625-0060993,No,"MATCHETT, LUKE & BIRD, MARIA N.","923 W EASTLAND AVE, NASHVILLE, TN",...,2.0,1.0,0.0,2015,NASHVILLE,923 W EASTLAND AVE,923 W EASTLAND AVE,NASHVILLE,TN,2
118,12620,107 13 0A 026.00,RESIDENTIAL CONDO,"926 COARSEY DR, NASHVILLE",2014,25000,20140207-0011111,No,None,None,...,NaN,NaN,NaN,2014,NASHVILLE,926 COARSEY DR,None,None,None,2
119,27361,119 16 0 080.00,SINGLE FAMILY,"934 DRUMMOND DR, NASHVILLE",2015,139000,20150218-0013634,No,"FORD, KELLY JOSEPH","934 DRUMMOND DR, NASHVILLE, TN",...,2.0,1.0,0.0,2015,NASHVILLE,934 DRUMMOND DR,934 DRUMMOND DR,NASHVILLE,TN,2

Warning: Total number of columns (26) exceeds max_columns (20) limiting to first (20) columns.

In [161]:
#Deleting out the Duplicate Values in CTE
cursor = conn.execute("DELETE FROM NashvilleHousing WHERE [UniqueID ] IN ( SELECT [UniqueID ] FROM ( SELECT [UniqueID ], ROW_NUMBER() OVER ( PARTITION BY ParcelID, PropertyAddress, SalePrice, SaleDate, LegalReference ORDER BY [UniqueID ]) row_num FROM NashvilleHousing ) t WHERE row_num > 1 )")

In [176]:
cursor = conn.execute("WITH RowNumCTE AS ( SELECT *, ROW_NUMBER() OVER ( PARTITION BY ParcelID, PropertyAddress, SalePrice, SaleDate, LegalReference ORDER BY [UniqueID ] ) row_num FROM NashvilleHousing ) SELECT * FROM RowNumCTE WHERE row_num > 1 ORDER BY PropertyAddress")
results = cursor.fetchall()
df = pd.DataFrame(results, columns=[col[0] for col in cursor.description])
display(df)

Empty DataFrame
Columns: [UniqueID , ParcelID, LandUse, PropertyAddress, SaleDate, SalePrice, LegalReference, SoldAsVacant, OwnerName, OwnerAddress, Acreage, TaxDistrict, LandValue, BuildingValue, TotalValue, YearBuilt, Bedrooms, FullBath, HalfBath, SaleDateConverted, PropertySplitCity, PropertySplitAddress, OwnerSplitAddress, OwnerSplitCity, OwnerSplitState, row_num]
Index: []

[0 rows x 26 columns]

In [ ]:
#DELETING OF UNUSED  COLUMNS
cursor = conn.execute("ALTER TABLE NashvilleHousing DROP COLUMN OwnerAddress")
cursor = conn.execute("ALTER TABLE NashvilleHousing DROP COLUMN TaxDistrict")
cursor = conn.execute("ALTER TABLE NashvilleHousing DROP COLUMN PropertyAddress")
cursor = conn.execute("ALTER TABLE NashvilleHousing DROP COLUMN SaleDate")